# brew faq: https://docs.brew.sh/FAQ
# most popular formulae: https://formulae.brew.sh/analytics/
# Search for brews at: https://formulae.brew.sh/formula/
# Search for casks at: https://formulae.brew.sh/cask/

# Repositories — see https://docs.brew.sh/Taps
# brew tap adds more repositories to the list of formulae that brew tracks,
# updates, and installs from. By default, tap assumes that the repositories
# come from GitHub, but the command isn’t limited to any one location.
tap 'caskroom/cask'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Core Homebrew
brew 'cmake' #Tool for browsing source code
brew 'coreutils' # Those that come with macOS are outdated
brew 'cscope' #Tool for browsing source code
brew 'csvkit' #Suite of command-line tools for converting to and working with CSV
brew 'findutils'
brew 'ffmpeg'
brew 'gcc'
brew 'gdbm' #GNU database manager
brew 'gettext' #GNU internationalization (i18n) and localization (l10n) library
brew 'graphicsmagick'
brew 'howdoi'
brew 'jasper' #Library for manipulating JPEG-2000 images
brew 'jpeg' #Also known as: libjpeg, libjpg
brew 'lame' #High quality MPEG Audio Layer III (MP3) encoder
brew 'libidn2'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libvorbis'
brew 'libvpx'
brew 'libyaml'
brew 'lsd' #Clone of ls with colorful output, file type icons, and more
brew 'lua'
brew 'mas' # Mac App Store manager
brew 'nvm'
brew 'openssl@1.1'
brew 'opus' #Audio codec
brew 'pipenv'
brew 'pyinstaller' #Bundle a Python application and all its dependencies
brew 'python'
brew 'pv'
brew 'readline' #Library for command-line editing
brew 'ruby'
brew 'sdl2' #Low-level access to audio, keyboard, mouse, joystick, and graphics
brew 'snappy' #Compression/decompression library aiming for high speed
brew 'sqlite'
brew 'sshfs'
brew 'theora' #Open video compression format
brew 'trash-cli' Move files to macOS's Trash
brew 'tree' #Display directories as trees (with optional color/HTML output)
brew 'vim'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xclip'
brew 'xvid'
brew 'yarn'
brew 'ydiff'

# Cask Apps
# Brew cask is an extension to brew that allows management of graphical
# applications through the Cask project.
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'meld'
cask 'osxfuse'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlstephen' # A QuickLook plugin that lets you view plain text files without a file extension
cask 'qlmarkdown'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'sketch'
cask 'spotify'
cask 'the-unarchiver'
cask 'there'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'

# Mac App Store (see brew 'mas'above)
mas 'ColorSlurp', id: 1287239339
